demo/FSIBeam_interFSIFoam_2206/sub-iter_1/runData/fluidDomain/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          512;
        startFace       84128;
    }
    outlet
    {
        type            patch;
        nFaces          512;
        startFace       84640;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          928;
        startFace       85152;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          896;
        startFace       86080;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1856;
        startFace       86976;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1792;
        startFace       88832;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          352;
        startFace       90624;
    }
)

// ************************************************************************* //
